{
    "records": [
	{
	    "image": "https://clipart-library.com/img/1517126.png",
	    "label": "July 6 - Session One",
	    "topic": "Introduction to Chairmanship",
	    "type": "projects",
	    "details": {
		"date": "July 6, 2024",
		"room": "West Room (second floor)",
		"coordinator": "Paul Ireifej",
		"co-coordinator": "None"
	    },
	    "desc2": "<ul><li>&bull;  Welcome the participants</li><li>&bull; Distribute the workbooks</li><li>&bull; Brief explanation of the Youth Leadership Program</li><li>&bull; Get-acquainted exercise</li><li>&bull; Discussion of chairmanship principles</li><li>&bull; Nomination and election of officers for Sessions 1, 2, 3, and 4</li><li>&bull; Evaluation of present speaking abilities</li><li>&bull; Discussion of assignments for Session Two</li></ul>",
	    "desc": "<ul><li>&bull;  Thanks for coming, Kenzie, Aashish and Arav! Also had special helper Gabriel (my son).</li><li>&bull; We had a \"get-acquainted exercise\". Gabriel and Arav introduced each other. Kenzie and Aashish introduced each other.</li><li>&bull; We had officer elections. Congratulations to Arav, who will serve as President. Aashish will serve as Vice President. Kenzie will serve as Sergeant at Arms.</li><li>&bull; We are still in need of a Secretary.</li><li>&bull; Next session, Kenzie, Aashish and Arav will present a four to five minute speech. Also, President Arav will kick off the meeting with an inspirational message and/or a joke.</li><li>&bull; Next session, Kimberly Chung will serve as coordinator.</li></ul>",
	    "link": "https://youtube.com/shorts/pOP5Wd0KHKc?si=BuNUaXshG9hihzRt"
	},
	{
	    "image": "https://png.pngtree.com/png-vector/20240124/ourmid/pngtree-public-speaking-and-introduction-png-image_11475900.png",
	    "label": "July 20 - Session Two",
	    "topic": "Introduction to Public Speaking",
	    "type": "projects",
	    "details": {
		"date": "July 20, 2024",
		"room": "West Room (second floor)",
		"coordinator": "Kimberly Chung",
		"co-coordinator": "None"
	    },
	    "desc2": "<ul><li>&bull; Introduction and call to order</li><li>&bull; Presentation of speeches</li><li>&bull; Evaluation of speeches</li><li>&bull; Discussion of elements of a good speech</li><li>&bull; Assignments for Session Three</li><li>&bull; Adjournment</li></ul>",
	    "desc": "<ul><li>&bull;  Thanks for coming, Kenzie, Warren, Parth, Rayan and Eva!</li><li>&bull; Dr. Kimberly Chung led the session as the Coordinator.</li><li>&bull;Reviewed Session One.</li><li>&bull;Kenzie gave a speech about the 'Power of Resilience'. Dr. Chung gave a speech about her pets.</li><li>&bull;Discussion of what makes a good evaluation.</li><li>&bull;Dr. Chung gave an evaluation of Kenzie's speech.</li><li>&bull;Group evaluation and Rayan's evaluation of Dr. Chung's speech.</li><li>&bull;Warren served as the Table Topics Master. Rayan talked about his favorite subject. Eva talked about doing homework. Kenize talked about the world being just one color. Parth talked about math tests.</li><li>&bull;Rayan provided a general evaluation of the meeting.</li><li>&bull;For next session, Rayan will present the word of the day. Parth will give a speech.</li><li>&bull;Aashish and Arav will present a four to five minute speech. President Arav will kick off the meeting with an inspirational message and/or a joke.</ul>"
	},
	{
	    "image": "https://i0.wp.com/www.michigandaily.com/wp-content/uploads/2018/10/18_10_16-Public-Speaking.png?fit=720%2C709&ssl=1",
	    "label": "July 27 - Session Three",
	    "topic": "Impromptu Speaking",
	    "type": "projects",
	    "details": {
		"date": "July 27, 2024",
		"room": "West Room (second floor)",
		"coordinator": "Paul Ireifej",
		"co-coordinator": "Kimberly Chung"
	    },
	    "desc2": "<ul><li>&bull; Call to order and reading of the minutes</li><li>&bull; Presentation of speeches</li><li>&bull; Evaluation of speeches</li><li>&bull; Introduction to Table Topics</li><li>&bull; Review of principles of group discussion</li><li>&bull; Assignments for Session Four</li><li>&bull; Adjournment</li></ul>",
	    "desc": "<ul><li>&bull; Thank you, Eva and Kenzie for your attendance!</li><li>&bull; Dr. Chung served as temporary secretary. She read the meeting minutes from last week and took notes for this session. </li><li>&bull; Eva served as Speaker 1. Her speech title is 'Melony.' She spoke about her dog, how they named her and taught her tricks.</li><li>&bull; Everyone gave feedback to Eva. Kenzie liked Eva's voice flucuation and tone, word choice, and said she has beautiful ideas. She can improve with more eye contact.</li><li>&bull; Dr. Chung liked that Eva talked about her pet, had good descriptions like 'khaki' colored dog. Eva was confident, started her speech right away, stayed calm and had good body movements. She had suggested Eva use more details like describe the dog's fur and eye color.</li><li>&bull; Paul enjoyed the personal stories, interesting details and pauses. Suggestions were about pausing when you get up to wait for the coordinator to sit down before speaking, putting notes down on lectern and trying to make eye contact.</li><li>&bull; We reviewed what Table Topics are and talked about the importance of impromptu speaking.</li><li>&bull; Dr. Chung served as Table Topics Master and asked questions about the Olympics. Kenize and Eva answered two questions each.</li><li>&bull;  We then reviewed the principles of Group Discussion, including the conference and the panel discussion.</li><li>&bull; We participated in a group exercise discussion about how we would approach our parents if they told us about a friend whom they don't want us to spend time with.</li><li>&bull; Kenize then shared our solution with the group which included asking our parents for more information, asking why they don't want us to see this friend, and trying to resolve or get a better understanding of the issues about this friend. But, in the end, we listen to our parents' decision.</li><li>&bull; We will do officer nominations next session.</li><li>&bull; Eva and Kenzie will both present a speech.</li><li>&bull; We discussed ideas for the last session, the Special Event. Ideas include speech contest, panel discussion or a debate.</li></ul>"
	},
	{
	    "image": "https://png.pngtree.com/png-clipart/20231002/original/pngtree-man-giving-speech-on-podium-illustration-in-minimal-style-png-image_13067645.png",
	    "label": "August 3 - Session Four",
	    "type": "projects",
	    "topic": "Organizing Your Speech",
	    "details": {
		"date": "August 3, 2024",
		"room": "West Room (second floor)",
		"coordinator": "Paul Ireifej",
		"co-coordinator": "None"
	    },
	    "desc2": "<ul><li>&bull; Call to order and reading of the minutes</li><li>&bull; Table Topics</li><li>&bull; Presentation of speeches</li><li>&bull; Evaluation of speeches</li><li>&bull; Election of officers for Sessions Five through Eight</li><li>&bull; Discussion of speech organization</li><li>&bull; Assignment for Session Five</li><li>&bull; Adjournment</li></ul>",
	    "desc": "<ul><li>&bull; Thank you, Warren, Eva and Rayan for your participation!</li><li>&bull; Thank you, guest helpers Gabriel and Raphael for your help!</li><li>&bull; Coordinator Paul Ireifej opened the meeting.</li><li>&bull; Gabriel and Raphael delivered an inpsirational message.</li><li>&bull; Paul read the meeting minutes from last session.</li><li>&bull; Warren was our first speaker. His speech title was \"Me / All About Myself \".</li><li>&bull; Eva was our second speaker. Her speech title was \"Me\".</li><li>&bull; Rayan was our third speaker. His speech title was \"My Hobbies.\"<li><li>&bull; Raphael evaluated Warren. Some feedback Warren received: good humor, eye contact, vocabulary, body gestures and summary. To improve, try to slow down when you speak.</li><li>&bull; Gabriel evaluated Eva. Some feedback Eva received: good details, description and descriptive words, nice recovery after losing your place. To improve, speak louder and use eye contact.</li><li>&bull; Paul evaluated Rayan. Some feedback Rayan received: excellent job speaking without notes, gave us an outline upfront, good gestures and eye contact. Some feedback Rayan received: speak louder and be conscience of the \"so\" filler word.</li><li>&bull; We did Table Topics. Rayan served as Table Topics Master.</li><li>&bull; We learned that Warren likes the color dark gray. Eva's favorite season is winter because she loves the snow, snowboarding and wearing baggy clothes. Gabriel spoke about being 8 years old and 50 years old. Raphael told us what he likes to eat. Eva answered a second question and told us she likes to wear sweaters because she's always cold.</li><li>&bull; Paul then spoke about speech organization, using an outline, and why you should organize your speech.</li><li>&bull; Congratulations to Warren, who will be serving as our President. Congratulations to Rayan, who will be serving as our Vice President & SAA. Congratulations to Eva, who will be serving as our Secretary.</li><li>&bull; We discussed the Special Event. We have one vote towards doing a speech contest and two votes towards doing a debate during our last session.</li></ul>"
	},
	{
	    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e8/Contented_Guy_Listening_To_Mobile_Music_Cartoon.svg/640px-Contented_Guy_Listening_To_Mobile_Music_Cartoon.svg.png",
	    "label": "August 10 - Session Five and Six",
	    "type": "projects",
	    "topic": "Listening and Body Gestures",
	    "details": {
		"date": "August 10, 2024",
		"room": "Meeting Room (downstairs)",
		"coordinator": "Paul Ireifej",
		"co-coordinator": "Kimberly Chung"
	    },
	    "desc2": "<ul><li>&bull; Call to order and reading of the minutes</li><li>&bull; Table Topics</li><li>&bull; Presentation of speeches</li><li>&bull; Evaluation of speeches</li><li>&bull; Discussion of listening</li><li>&bull; Exercise for listening</li><li>&bull; Discussion of Gestures</li><li>&bull; Assignments for Session Seven</li><li>&bull; Adjournment</li></ul>",
	    "desc": "<ul><li>&bull; Thank you Warren, Eva, Rayan and Kenzie for your participation!</li><li>&bull; President Warren delivered a funny and inspirational invocation.</li><li>&bull; Paul read the meeting minutes from Session Four.</li><li>&bull; Paul delivered a speech about his journey with speaking.</li><li>&bull; Dr. Kimberly Chung gave him an evaluation.</li><li>&bull; Dr. Chung acted as Table Topics Master. The theme was 'new experiences.' Vice President Rayan acted as Timer.</li><li>&bull; Kenize talked about his trip to Japan. Eva talked about how she would like to visit Japan. Warren talked about speaking Chinese and mentioned he would like to learn Spanish. Rayan talked about being scared about trying a big water slide, but overcoming the fear.</li><li>&bull; We learned about The Art of Listening, including some bad habits and effective listening.</li><li>&bull; We had a group exercise to practice good listening techniques. Eva paired up with Warren and Rayan paired up with Kenzie.</li><li>&bull; Dr. Chung led the discussion about listening.</li><li>&bull; We learned about body gestures and how to show what we mean using our arms, facial expressions and body.</li><li>&bull; The group decided on doing a debate for the August 24 'Show Your Skills' special event.</li></ul>"
	},
	{
	    "image": "https://upload.wikimedia.org/wikipedia/commons/6/60/Casual_Cartoon_Male_Public_Speaker.svg",
	    "label": "August 17 - Session Seven",
	    "type": "projects",
	    "topic": "Voice and Vocabulary",
	    "details": {
		"date": "August 17, 2024",
		"room": "West Room (second floor)",
		"coordinator": "Paul Ireifej",
		"co-coordinator": "None"
	    },
	    "desc": "<ul><li>&bull; Thank you to our guest Aarav.</li><li>&bull; President Warren delivered an invocation and joke.</li><li>&bull; Secretary Eva read the meeting minutes.</li><li>&bull; Aarav acted as the timer.</li><li>&bull; Guest Gabriel delivered a speech titled,\"The Story of How I Wrote This Speech.\"</li><li>&bull; Rayan delivered a speech titled, \"Four Friends.\"</li><li>&bull; Eva delivered a speech titled, \"My First Roller Coaster Ride.\"</li><li>&bull; Guest Raphael delivered a speech, \"The Airplane Flight from USA to China.\"</li><li>&bull; Warren evaluated Gabriel.</li><li>&bull; Aarav evaluated Rayan.</li><li>&bull; Rayan's father evaluated Eva.</li><li>&bull; Gabriel evaluated Raphael.</li><li>&bull; Warren volunteered as Table Topics Master. Gabriel talked about his scariest time in school. Rayan talked about how he feels about going back to school. Eva talked about skateboarding. Aarav talked about Math class. Raphael talked about a friend who he likes. Rayan's father talked about his co-workers.</li><li>&bull; Coordinator Paul talked about voice and vocabulary. Your speaking voice is your best tool. Focus on what kind of voice you and others have: harsh, monotonous, tiresome? Your voice is a balance between volume, pitch and rate. A good speaking voice is pleasant and friendly. Practice your talk in front of someone else. Improve your articulation with stretching and mouse exercises.</li><li>&bull; Please evaluate your progress in pages 30 and 31 of your workbook.</li></ul>"
	},
	{
	    "image": "https://i.pinimg.com/originals/2f/2d/fd/2f2dfdaf4fe93fa45a609691f3d0b8f9.gif",
	    "image2": "https://miro.medium.com/v2/resize:fit:1358/1*Vf52xKMVr8PbdJJCrNKViQ.png",
	    "label": "August 24 - Session Eight",
	    "type": "projects",
	    "topic": "Show Your Skills",
	    "details": {
		"date": "August 24, 2024",
		"room": "West Room (second floor)",
		"coordinator": "Paul Ireifej",
		"co-coordinator": "Kimberly Chung"
	    },
	    "desc": "<ul><li>&bull; President Warren delivered an invocation with a joke.</li><li>&bull; Eva read the meeting minutes from Session Seven.</li><li>&bull; Warren delivered a speech titled \"My Eating Journey.\" Rayan was the evaluator.</li><li>&bull; We started the debate. The Affirmative Team was Rayan and Eva. They are trying to defend the position that junk food should be banned from schools. The Negative Team was Warren and Aarav. They are trying to defend the position that junk food should NOT be banned from schools.</li><li>&bull; Both teams gave a two minute opening and a two minute rebuttal and conclusion.</li><li>&bull; Kimberly led the group through a discussion about everyone's progress through the Youth Leadership Program.</li><li>&bull; The certificates were distributed. The session was closed. Thank you everyone for your hard work and participation.</li></ul>"
	}
    ]
}
